<?php

return [
    ['hex' => '#000000', 'name' => 'Черный', 'pattern' => ['черный', 'черн', 'чёрн', 'black']],
    ['hex' => '#FFFFFF', 'name' => 'Белый', 'pattern' => ['белый', 'белые', 'белого', 'белое', 'белая', 'white']],

    ['hex' => '#F5F5DC', 'name' => 'Бежевый', 'pattern' => ['бежев', 'beige']],
    ['hex' => '#87CEFA', 'name' => 'Голубой', 'pattern' => ['голуб']],
    ['hex' => '#0000FF', 'name' => 'Синий', 'pattern' => ['синий', 'синие', 'синего', 'синее', 'синяя', 'blue']],
    ['hex' => '#FFFF00', 'name' => 'Желтый', 'pattern' => ['желт', 'жёлт', 'yellow']],
    ['hex' => '#008000', 'name' => 'Зеленый', 'pattern' => ['зеленый', 'зелен', 'зелён', 'green']],
    ['hex' => '#FFD700', 'name' => 'Золотистый', 'pattern' => ['золот', 'gold']],
    ['hex' => '#A52A2A', 'name' => 'Коричневый', 'pattern' => ['коричнев', 'brown']],
    ['hex' => '#FF0000', 'name' => 'Красный', 'pattern' => ['красный', 'красн', 'red']],
    ['hex' => '#FFA500', 'name' => 'Оранжевый', 'pattern' => ['оранжев', 'orange']],
    ['hex' => '#800080', 'name' => 'Пурпурный', 'pattern' => ['пурпурн', 'purple']],
    ['hex' => '#FFC0CB', 'name' => 'Розовый', 'pattern' => ['розов', 'pink']],
    ['hex' => '#C0C0C0', 'name' => 'Серебристый', 'pattern' => ['серебристый', 'серебрян', 'серебрист', 'silver', 'cеребристый', 'еребристый']],
    ['hex' => '#808080', 'name' => 'Серый', 'pattern' => ['серый', 'серые', 'серого', 'серое', 'серая', 'grey', 'графит']],
    ['hex' => '#EE82EE', 'name' => 'Фиолетовый', 'pattern' => ['фиолетов', 'violet']],
    ['hex' => '#660000', 'name' => 'Бордовый', 'pattern' => ['бордов']],
];
